files/astronomy/public/6.NumericalSimulations.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-04-08 Fri 16:45 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>&lrm;</title>
<meta name="generator" content="Org mode">
<meta name="author" content="ChongChong He">
<meta http-equiv='X-UA-Compatible' content='IE=edge'> <meta name='viewport' content='width=device-width, initial-scale=1'><link rel='stylesheet' href='https://www.astro.umd.edu/~chongchong/html_styles/common/toc-left.css' type='text/css' />
</head>
<body>
<div> <a accesskey='h' href='index.html'> UP </a> | <a accesskey='H' href='index.html'> HOME </a> </div><div id="content">
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#hydrodynamic Al-simulations">1. Codes</a>
<ul>
<li><a href="#methods-and-code">1.1. Hydro Methods and Codes, Summary</a></li>
<li><a href="#sec:ramses">1.2. RAMSES</a>
<ul>
<li><a href="#summary">1.2.1. Summary</a></li>
<li><a href="#features">1.2.2. Features</a></li>
<li><a href="#m1-closure">1.2.3. M1 closure</a></li>
<li><a href="#cooling-function">1.2.4. Cooling Function</a></li>
<li><a href="#orge1748c2">1.2.5. Sink particles</a></li>
</ul>
</li>
<li><a href="#n-body">1.3. N-body</a></li>
<li><a href="#hydro">1.4. Hydro Codes</a>
<ul>
<li><a href="#orgfdace1e">1.4.1. Fire</a></li>
<li><a href="#orgbb85418">1.4.2. </a></li>
</ul>
</li>
<li><a href="#observations">1.5. Mock Observations</a>
<ul>
<li><a href="#stellar-population-sythesis">1.5.1. Stellar population sythesis</a></li>
<li><a href="#filters">1.5.2. Filters</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org651c4d9">2. Simulation Projects</a>
<ul>
<li><a href="#org28110c8">2.1. FIRE: Feedback In Realistic Environments</a></li>
<li><a href="#orgfa7a5d0">2.2. DRAGON</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<div id="outline-container-hydrodynamic Al-simulations" class="outline-2">
<h2 id="hydrodynamic Al-simulations"><span class="section-number-2">1</span> Codes</h2>
<div class="outline-text-2" id="text-hydrodynamic Al-simulations">
</div>

<div id="outline-container-methods-and-code" class="outline-3">
<h3 id="methods-and-code"><span class="section-number-3">1.1</span> Hydro Methods and Codes, Summary</h3>
<div class="outline-text-3" id="text-methods-and-code">
<p>
Specification of the flow field:
</p>

<ul class="org-ul">
<li>Euler approach: The fluid properties are written as functions of space and times. Cons: limited dynamic range.</li>

<li>Lagrangian approach: Pieces of the fluid are "tagged". The fluid flow properties are determined by tracking the motion and properties of the particles as they move in time.</li>

<li>Smooth Particles Hydrodynamics (SPH): an intermediate solution. Follows the Lagrangian evolution of the flow, in which resolution elements are defined as appropriate averages over 50 neighboring particles.</li>
</ul>

<p>
Methods of N-body code:
</p>

<ul class="org-ul">
<li>Particle-Mesh: fastest, but only support dynamical range of \(10^3\).</li>

<li>P3M: higher spatial resolution, but significant increase in CPU time.</li>

<li>AP3M: rectangular grids is placed in clustered regions to apply PM
solver.</li>

<li>AMR: Generalization of both AP3M and TREE. e.g. ART.</li>
</ul>

<p>
N-body code:
</p>

<ul class="org-ul">
<li>ART:

<ul class="org-ul">
<li>The first implementation of a grid-based high-resolution N-body code.</li>

<li>AMR: recursively in a fully adaptive manner in the regions where the density exceeds a predefined threshold. Mean number of particles per cell remains roughly constant (around 10).</li>

<li>"Quasi-Lagrangian" approach ensures two-body relaxation remains unimportant.</li>

<li>The mesh structure is not created at every time step, but is properly adjusted to the evolving particle distribution.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-sec:ramses" class="outline-3">
<h3 id="sec:ramses"><span class="section-number-3">1.2</span> RAMSES</h3>
<div class="outline-text-3" id="text-sec:ramses">
</div>

<div id="outline-container-summary" class="outline-4">
<h4 id="summary"><span class="section-number-4">1.2.1</span> Summary</h4>
<div class="outline-text-4" id="text-summary">
<ul class="org-ul">
<li>The AMR grid is built on a tree structure.</li>

<li>The hydrodynamic solver is based on a second order Godunov method, to solve the Euler equation.</li>

<li>Refinement strategy retained for cosmological simulations is based on a "quasi-Lagrangian" mesh evolution.</li>
</ul>
</div>
</div>

<div id="outline-container-features" class="outline-4">
<h4 id="features"><span class="section-number-4">1.2.2</span> Features</h4>
<div class="outline-text-4" id="text-features">
<ul class="org-ul">
<li>Coupling a tree-based AMR hydrodynamical scheme to the N-body solver developed for the ART code.</li>

<li>Hydrodynamical solver: second-order Godunov scheme for perfect gases.</li>
</ul>
</div>
</div>

<div id="outline-container-m1-closure" class="outline-4">
<h4 id="m1-closure"><span class="section-number-4">1.2.3</span> M1 closure</h4>
<div class="outline-text-4" id="text-m1-closure">
<p>
Assume that the radiation field is locally a dipole. The photon distribution function is the Lorentz transform of a Planckian distribution. Dipole is aligned locally to the radiation flux.
</p>

<p>
Under M1, the radiative transfer equation is turned into an hyperbolic system of conservation laws with source terms.
</p>
</div>
</div>

<div id="outline-container-cooling-function" class="outline-4">
<h4 id="cooling-function"><span class="section-number-4">1.2.4</span> Cooling Function</h4>
<div class="outline-text-4" id="text-cooling-function">
<p>
Possibly a big issue!!! I see a mu=1.4 with comments: hard set mu=1.4 to make temperature agree with Audic &amp; Hennebelle.
</p>

<ol class="org-ol">
<li>For hydrogen and helium
<ol class="org-ol">
<li>In each cell, photoheating and radiative cooling of hydrogen and helium is performed by the radiative transfer module of RAMSES-RT as in Rosdahl et al. (2013).</li>
<li>Photoheating rate \(\mathcal{H}\) is a sum of the heating contributiosn from all photoionziation events (HI, HeI, and HeII).</li>
<li>The primordial cooling rate \(\mathcal{L}\) include various cooling processes: collisional ionizations, collisional excitations, recombinations, dielectronic recombinations, bremsstrahlung and Compton cooling.</li>
</ol></li>
<li>For metals
<ol class="org-ol">
<li>'Neutral' function N(T)
<ul class="org-ul">
<li>Below 10<sup>4</sup> K: the prescription of Audit &amp; Hennebelle (2005), which includes <b>carbon, oxygen and dust grains</b> as well as the <b>ambient UV background</b> in the ISM. This is based on the work of Wolfire et al. (1995, 2003).
<ul class="org-ul">
<li>Including cooling by
<ul class="org-ul">
<li>fine-structure lines of CII (92 K)</li>
<li>fine-structure lines of OI (228 and 326 K)</li>
<li>cooling by H (Lyα line)</li>
<li>cooling by electron recombination onto positively charged grains</li>
</ul></li>
<li>and heating by
<ul class="org-ul">
<li>photo-electric effect on small grains and PAHs due to the FUV galactic radiation.</li>
</ul></li>
<li>(This might be probmatic due to the hard mu = 1.4. In Audit2005, they have no radiative transfer, so the mean particle weight is constant at mu = 1.4, while in RAMSES RT, mu is much higher(lower?) due to ionized electrons.)</li>
</ul></li>
<li>Above \(10^4\) K: Sutherland &amp; Dopita (1993)</li>
</ul></li>
<li>'Photoionized' cooling function
<ul class="org-ul">
<li>a piecewise fit to Ferland (2003): \(\Lambda = 3\times10^{-24}~{\rm erg~cm^3~s^{-1}}\) below 9000 K and \(2.2\times10^{-22}~{\rm erg~cm^3~s^{-1}}\) above 10<sup>5</sup> K.</li>
</ul></li>
</ol></li>
<li>For H/He
<ul class="org-ul">
<li>&#x2026;</li>
</ul></li>
</ol>

<p>
TODO: make a curve of the cooling funciton
</p>
</div>

<ol class="org-ol">
<li><a id="org36b86a0"></a>Thermal update<br>
<div class="outline-text-5" id="text-1-2-4-1">
<p>
\[
\frac{\partial e}{\partial t} = \Gamma \equiv {\cal H} + {\cal L}
\]
where \({\cal H}\) is the photoheating rate and \({\cal L}\) is the cooling rate.
</p>

<p>
The photoheating rate \({\cal H}\) is a sum of the heating contributions form all photoionization events, calculated with the discretization into M photon groups.
</p>

<p>
The various cooling processes are collisional ionizations/excitations, recombinations, dielectronic recombinations, bremsstrahlung, and Compton cooling.
</p>

<p>
<b>On-the-spot approximation</b> recombination-emitted photons are absorbed ‘on the spot’ by a near-lying atom (in the same cell), and hence these photon emissions cancel out by local photon absorptions. When OTSA is assumed, the gas is not photoemitting, and the case A recombination rates are replaced with case B recombination rates
</p>
</div>
</li>

<li><a id="org0ca571c"></a>In code<br>
<div class="outline-text-5" id="text-1-2-4-2">
<p>
<code>ramses/patch/frig/main/cooling_module_frig.f90</code>:
</p>
<ul class="org-ul">
<li>cooling<sub>low</sub>(T, n, ref): low-T cooling</li>
<li>cooling<sub>high</sub>(T, n, ref): high-T cooling</li>
</ul>
</div>
</li>

<li><a id="org5664f81"></a>Other notes<br>
<div class="outline-text-5" id="text-1-2-4-3">
<p>
Mean particle mass, \(\mu\), is correctly calculated by the function <code>getMu</code> in main/rt<sub>cooling</sub><sub>module.f90</sub>:
</p>

<p>
\[
\mu = [X(1+x_{\rm HII}) + \frac{Y}{4}(1 + x_{\rm HeII} + 2x_{\rm HeIII})]^{-1}
\]
Note that in the most basic H and He senario, we have \(1/\mu = X/1 + Y/4\). 
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-orge1748c2" class="outline-4">
<h4 id="orge1748c2"><span class="section-number-4">1.2.5</span> Sink particles</h4>
<div class="outline-text-4" id="text-1-2-5">
<ul class="org-ul">
<li>IR feedback from accretion: exists in current version. Use <code>ir_feedback</code> under <span class="underline">Feedback parameters</span>.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-n-body" class="outline-3">
<h3 id="n-body"><span class="section-number-3">1.3</span> N-body</h3>
<div class="outline-text-3" id="text-n-body">
<ul class="org-ul">
<li><a href="https://www.cs.cmu.edu/afs/cs/academic/class/15850c-s96/www/nbody.html">N-Body/Particle Simulation Methods</a></li>
</ul>

<p>
The density field is computed using the 'Cloud-In-Cell' (CIC) interpolation scheme. The Poisson equation at the course level is solved using standard FFT technique. For fine levels, the potential is found using a relaxation method. The acceleration is then calculated using the 6-points finite difference approximation of the gradient. Variable time steps: a second-order midpoint scheme that reduces exactly to the leapfrog scheme for constant time steps.
</p>
</div>
</div>

<div id="outline-container-hydro" class="outline-3">
<h3 id="hydro"><span class="section-number-3">1.4</span> Hydro Codes</h3>
<div class="outline-text-3" id="text-hydro">
</div>

<div id="outline-container-orgfdace1e" class="outline-4">
<h4 id="orgfdace1e"><span class="section-number-4">1.4.1</span> Fire</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
The FIRE simulations use the P-SPH code, a heavily modified version of Volker Springel’s Gadget 3 code whose development is led by Phil Hopkins. In addition to the explicit ISM and stellar feedback physics, P-SPH uses apressure-entropy implementation of smooth particle hydrodynamics (SPH) that resolves all the main historical discrepancies between grid-based and SPH methods, particularly for fluid mixing instabilities.
</p>
</div>
</div>

<div id="outline-container-orgbb85418" class="outline-4">
<h4 id="orgbb85418"><span class="section-number-4">1.4.2</span> </h4>
</div>
</div>

<div id="outline-container-observations" class="outline-3">
<h3 id="observations"><span class="section-number-3">1.5</span> Mock Observations</h3>
<div class="outline-text-3" id="text-observations">
</div>

<div id="outline-container-stellar-population-sythesis" class="outline-4">
<h4 id="stellar-population-sythesis"><span class="section-number-4">1.5.1</span> Stellar population sythesis</h4>
<div class="outline-text-4" id="text-stellar-population-sythesis">
<p>
FSPS: Flexible Stellar Population Synthesis:
<a href="https://github.com/cconroy20/fsps">https://github.com/cconroy20/fsps</a>
</p>

<p>
pythonFSPS (Flexible Stellar Population Synthesis for Python):
<a href="http://dfm.io/python-fsps/current/">http://dfm.io/python-fsps/current/</a>
</p>

<p>
Starburst99
</p>

<ul class="org-ul">
<li><a href="https://github.com/rjtanner/StarburstPy">https://github.com/rjtanner/StarburstPy</a></li>
<li><a href="https://github.com/Morisset/pyStb99">https://github.com/Morisset/pyStb99</a></li>
</ul>

<p>
<a href="https://users.astro.ufl.edu/~desika.narayanan/courses/ism_spring19/hw4.pdf">https://users.astro.ufl.edu/~desika.narayanan/courses/ism_spring19/hw4.pdf</a>
</p>
</div>
</div>

<div id="outline-container-filters" class="outline-4">
<h4 id="filters"><span class="section-number-4">1.5.2</span> Filters</h4>
<div class="outline-text-4" id="text-filters">
<p>
JWST/NIRCam.F150W:
<a href="http://svo2.cab.inta-csic.es/svo/theory/fps3/index.php?id=JWST/NIRCam.F150W&amp;&amp;mode=browse&amp;gname=JWST&amp;gname2=NIRCam">http://svo2.cab.inta-csic.es/svo/theory/fps3/index.php?id=JWST/NIRCam.F150W&amp;&amp;mode=browse&amp;gname=JWST&amp;gname2=NIRCam</a>
</p>

<p>
Table of FSPS Filters: <a href="http://dfm.io/python-fsps/current/filters/">http://dfm.io/python-fsps/current/filters/</a>
</p>

<p>
SDSS Filters on astroML:
<a href="https://www.astroml.org/book_figures/appendix/fig_sdss_filters.html">https://www.astroml.org/book_figures/appendix/fig_sdss_filters.html</a>
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org651c4d9" class="outline-2">
<h2 id="org651c4d9"><span class="section-number-2">2</span> Simulation Projects</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org28110c8" class="outline-3">
<h3 id="org28110c8"><span class="section-number-3">2.1</span> FIRE: Feedback In Realistic Environments</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<a href="https://fire.northwestern.edu/">https://fire.northwestern.edu/</a>
</p>
</div>
</div>

<div id="outline-container-orgfa7a5d0" class="outline-3">
<h3 id="orgfa7a5d0"><span class="section-number-3">2.2</span> DRAGON</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><a href="http://silkroad.bao.ac.cn/dragon/">The Dragon Simulation Project</a></li>
<li><a href="https://ui.adsabs.harvard.edu/abs/2016MNRAS.458.1450W/abstract">The Paper</a></li>
<li></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr><p>Author: <a href='https://www.astro.umd.edu/~chongchong/'>Chong-Chong He</a></p><p>Last updated: 2022-04-08</p>
</div>
</body>
</html>
